# 데이터프레임과 함수

In [1]:
import seaborn as sns
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]

## DF->f(x)->Series
- apply() 함수

In [2]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [3]:
def add_10(n):
    return n+10

def add_two_obj(a,b):
    return a+b

In [4]:
print(add_10(10))
print(add_two_obj(10,10))

20
20

In [5]:
sr1=df['age'].apply(add_10)

In [6]:
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [7]:
sr2=df['age'].apply(add_two_obj, b=20)

In [8]:
sr2.head()

0    42.0
1    58.0
2    46.0
3    55.0
4    55.0
Name: age, dtype: float64

## DF->f(x)->DF
- applymap() 함수
- apply 함수

### applymap을 통한 DF->f(x)->DF

In [9]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [10]:
def add_10(n):
    return n+10

In [11]:
df_map=df.applymap(add_10)
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### apply를 통한  DF->f(x)->DF

In [12]:
def missing_value(series):
    return series.isnull()

In [13]:
result=df.apply(missing_value,axis=0) #옵션 axis를 줌.
result.tail()

       age   fare
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

# 실습하기

## 각 열의 최대값-최소값

In [14]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [15]:
def fare_range(series):
    return series.max()-series.min()

In [16]:
a=df.apply(fare_range,axis=0)

In [17]:
a

age      79.5800
fare    512.3292
dtype: float64

In [18]:
df['age'].max()

80.0

In [19]:
df['age'].min()

0.42

In [20]:
df['fare'].max()

512.3292

In [21]:
df['fare'].min()

0.0

## 각열에 10씩 더하기

In [22]:
df['ten'] = 10

In [23]:
def add_two_obj(a, b):
    return a + b

df['add'] = df.apply(lambda x:add_two_obj(x['age'], x['ten']), axis=1)
df.head()

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

## pipe함수
> 모든값에 적용됨

In [26]:
df=titanic.loc[:,['age','fare']]
def missing_value(x):
    return x.isnull()
def missing_count(x):
    return missing_value(x).sum()

In [27]:
result=df.pipe(missing_value)
result.head()

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [28]:
result2=df.pipe(missing_count)
result2.head()

age     177
fare      0
dtype: int64

# 행순서 변경하기

## 가나다 정렬

In [30]:
df=titanic.loc[0:4, 'survived':'age']
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [31]:
columns=list(df.columns.values)
columns

['survived', 'pclass', 'sex', 'age']

In [32]:
columns_sort=sorted(columns)

In [34]:
columns_sort

['age', 'pclass', 'sex', 'survived']

In [35]:
df_sorted=df[columns_sort]

In [36]:
df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

## 순서뒤집기

In [40]:
columns

['survived', 'pclass', 'sex', 'age']

In [37]:
columns_reversed=list(reversed(columns))

In [41]:
columns_reversed

['age', 'sex', 'pclass', 'survived']

In [38]:
df_reversed=df[columns_reversed]

In [39]:
df_reversed

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

## 사용자정의순서

In [42]:
columns_custom=['pclass','age','survived','sex']
df_custom=df[columns_custom]

In [43]:
df_custom

   pclass   age  survived     sex
0       3  22.0         0    male
1       1  38.0         1  female
2       3  26.0         1  female
3       1  35.0         1  female
4       3  35.0         0    male